In [1]:
import numpy as np
import pandas as pd
import re

In [2]:
#Importamos csv
df=pd.read_csv('HR RAW DATA.csv')
df.head()

,Unnamed: 0,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,employeecount,...,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YEARSWITHCURRMANAGER,SameAsMonthlyIncome,DateBirth,Salary,RoleDepartament,NUMBERCHILDREN,RemoteWork
0,0,51,No,NaN,"684,0$",NaN,6,3,NaN,1,...,20,NaN,15,15,"19537,0",1972,1000000000$,NaN,NaN,Yes
1,1,52,No,NaN,"699,0$",NaN,1,4,Life Sciences,1,...,33,NaN,11,9,"19999,0",1971,1000000000$,NaN,NaN,1
2,2,42,No,travel_rarely,"532,0$",Research & Development,4,2,Technical Degree,1,...,22,NaN,11,15,"19232,0",1981,1000000000$,ManaGER - Research & Development,NaN,1
3,3,47,No,travel_rarely,"359,0$",NaN,2,4,Medical,1,...,20,NaN,5,6,"17169,0",1976,1000000000$,NaN,NaN,False
4,4,46,No,NaN,"1319,0$",NaN,3,3,Technical Degree,1,...,19,NaN,2,8,NaN,1977,1000000000$,NaN,NaN,0

In [3]:
#Creamos nueva variable para guardar la selección del rango de columnas que queremos.
#Este será nuestro csv
df_data=df.iloc[:, 1:]
df_data

,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,employeecount,employeenumber,...,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YEARSWITHCURRMANAGER,SameAsMonthlyIncome,DateBirth,Salary,RoleDepartament,NUMBERCHILDREN,RemoteWork
0,51,No,NaN,"684,0$",NaN,6,3,NaN,1,"162,0",...,20,NaN,15,15,"19537,0",1972,1000000000$,NaN,NaN,Yes
1,52,No,NaN,"699,0$",NaN,1,4,Life Sciences,1,"259,0",...,33,NaN,11,9,"19999,0",1971,1000000000$,NaN,NaN,1
2,42,No,travel_rarely,"532,0$",Research & Development,4,2,Technical Degree,1,"319,0",...,22,NaN,11,15,"19232,0",1981,1000000000$,ManaGER - Research & Development,NaN,1
3,47,No,travel_rarely,"359,0$",NaN,2,4,Medical,1,NaN,...,20,NaN,5,6,"17169,0",1976,1000000000$,NaN,NaN,False
4,46,No,NaN,"1319,0$",NaN,3,3,Technical Degree,1,NaN,...,19,NaN,2,8,NaN,1977,1000000000$,NaN,NaN,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1609,36,Yes,travel_rarely,"530,0$",NaN,3,1,Life Sciences,1,"967,0",...,16,NaN,3,7,"10325,0",1987,1000000000$,NaN,NaN,0
1610,45,No,non-travel,"805,0$",NaN,4,2,NaN,1,"972,0",...,9,NaN,0,8,"4447,0",1978,1000000000$,NaN,NaN,1
1611,39,No,travel_rarely,"903,0$",NaN,-13,5,NaN,1,NaN,...,8,NaN,0,7,NaN,1984,1000000000$,NaN,NaN,Yes
1612,36,No,non-travel,"1229,0$",NaN,8,4,Technical Degree,1,"990,0",...,7,NaN,0,7,NaN,1987,1000000000$,NaN,NaN,True
1613,46,No,NaN,"566,0$",NaN,7,2,Medical,1,NaN,...,8,NaN,0,7,"10845,0",1977,1000000000$,NaN,NaN,0

In [4]:
#Visualizamos la información básica del DataFram
df_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1614 entries, 0 to 1613
Data columns (total 41 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   Age                       1614 non-null   object
 1   Attrition                 1614 non-null   object
 2   BusinessTravel            842 non-null    object
 3   DailyRate                 1614 non-null   object
 4   Department                302 non-null    object
 5   DistanceFromHome          1614 non-null   int64
 6   Education                 1614 non-null   int64
 7   EducationField            869 non-null    object
 8   employeecount             1614 non-null   int64
 9   employeenumber            1183 non-null   object
 10  EnvironmentSatisfaction   1614 non-null   int64
 11  Gender                    1614 non-null   int64
 12  HourlyRate                1614 non-null   object
 13  JobInvolvement            1614 non-null   int64
 14  JobLevel                  1614 non-null   int64
 15  JobRole                   1614 non-null   object
 16  JobSatisfaction           1614 non-null   int64
 17  MaritalStatus             963 non-null    object
 18  MonthlyIncome             771 non-null    object
 19  MonthlyRate               1614 non-null   int64
 20  NUMCOMPANIESWORKED        1614 non-null   int64
 21  Over18                    713 non-null    object
 22  OverTime                  938 non-null    object
 23  PercentSalaryHike         1614 non-null   int64
 24  PerformanceRating         1419 non-null   object
 25  RelationshipSatisfaction  1614 non-null   int64
 26  StandardHours             419 non-null    object
 27  StockOptionLevel          1614 non-null   int64
 28  TOTALWORKINGYEARS         1088 non-null   object
 29  TrainingTimesLastYear     1614 non-null   int64
 30  WORKLIFEBALANCE           1506 non-null   object
 31  YearsAtCompany            1614 non-null   int64
 32  YearsInCurrentRole        34 non-null     object
 33  YearsSinceLastPromotion   1614 non-null   int64
 34  YEARSWITHCURRMANAGER      1614 non-null   int64
 35  SameAsMonthlyIncome       771 non-null    object
 36  DateBirth                 1614 non-null   int64
 37  Salary                    1614 non-null   object
 38  RoleDepartament           302 non-null    object
 39  NUMBERCHILDREN            0 non-null      float64
 40  RemoteWork                1614 non-null   object
dtypes: float64(1), int64(18), object(22)
memory usage: 517.1+ KB

In [5]:
#Exportamos el csv
df_data.to_csv('hr_data.csv', index=False)

In [6]:
#celda marga
#Seleccionamos celdadas - enviroment satisfaction-monthly rates 
#a traves, de df.info, tenemos información sobre las columnas:
df_columnas_parte_2=df_data.loc[:, 'EnvironmentSatisfaction':'MonthlyRate']
df_columnas_parte_2

,EnvironmentSatisfaction,Gender,HourlyRate,JobInvolvement,JobLevel,JobRole,JobSatisfaction,MaritalStatus,MonthlyIncome,MonthlyRate
0,1,0,51,3,5,resEArch DIREcToR,3,NaN,"19537,0",6462
1,3,0,65,2,5,ManAGeR,3,NaN,"19999,0",5678
2,3,0,58,3,5,ManaGER,4,Married,"19232,0",4933
3,1,1,82,3,4,ReseArCH DIrECtOr,3,Married,"17169,0",26703
4,1,1,45,4,4,sAleS EXECUtIve,1,Divorced,NaN,7739
...,...,...,...,...,...,...,...,...,...,...
1609,3,0,51,2,3,saLEs ExeCUTiVe,4,Married,"10325,0",5518
1610,3,0,57,3,2,LAboRaTOry tECHNiCIAn,2,NaN,"4447,0",23163
1611,13,0,41,4,3,sAlES ExECUTivE,3,Single,NaN,2560
1612,1,0,84,3,2,SaLes ExecUtIVe,4,Divorced,NaN,25952
1613,4,0,75,3,3,mAnUfactURInG DiRECTOr,3,NaN,"10845,0",24208

LIMPIEZA DE COLUMNAS:

In [7]:
#sACAMOS INFORMACION DE LOS VALORES UNICOS Y TIPO QUE TIENE CADA COLUMNA
for columna in df_columnas_parte_2.columns:
    print(f'Para la columna :',columna)
    print(f"valores unicos : \n{df_columnas_parte_2[columna].value_counts()}\n")
    
    print('-----------------------------------------------')

Para la columna : EnvironmentSatisfaction
valores unicos :
EnvironmentSatisfaction
4     460
3     459
1     298
2     297
12      7
35      6
13      6
14      5
24      5
47      5
36      4
48      4
41      4
46      4
42      4
45      3
11      3
22      3
17      3
18      3
20      3
25      3
27      3
37      2
29      2
19      2
38      2
31      2
15      2
16      2
26      1
39      1
10      1
49      1
21      1
28      1
33      1
43      1
Name: count, dtype: int64

-----------------------------------------------
Para la columna : Gender
valores unicos :
Gender
0    971
1    643
Name: count, dtype: int64

-----------------------------------------------
Para la columna : HourlyRate
valores unicos :
HourlyRate
Not Available    84
42               33
66               32
48               30
57               29
                 ..
47               15
53               13
68               13
38               12
34               11
Name: count, Length: 72, dtype: int64

-----------------------------------------------
Para la columna : JobInvolvement
valores unicos :
JobInvolvement
3    955
2    406
4    164
1     89
Name: count, dtype: int64

-----------------------------------------------
Para la columna : JobLevel
valores unicos :
JobLevel
2    597
1    586
3    242
4    113
5     76
Name: count, dtype: int64

-----------------------------------------------
Para la columna : JobRole
valores unicos :
JobRole
 mANager                       4
 ManageR                       3
 ManagEr                       3
 mAnaGeR                       3
 MANAgER                       3
                              ..
 ResEArch ScieNTiST            1
 HealthcARE RePreSENtAtiVe     1
 ReSearcH scIEntist            1
 LAbOrATOry techNicIan         1
 mAnUfactURInG DiRECTOr        1
Name: count, Length: 1579, dtype: int64

-----------------------------------------------
Para la columna : JobSatisfaction
valores unicos :
JobSatisfaction
4    514
3    481
1    317
2    302
Name: count, dtype: int64

-----------------------------------------------
Para la columna : MaritalStatus
valores unicos :
MaritalStatus
Married     404
Single      325
Divorced    188
Marreid      35
divorced     11
Name: count, dtype: int64

-----------------------------------------------
Para la columna : MonthlyIncome
valores unicos :
MonthlyIncome
6347,0     4
5304,0     4
2657,0     3
2258,0     3
5405,0     2
          ..
3102,0     1
4556,0     1
4230,0     1
4859,0     1
19431,0    1
Name: count, Length: 668, dtype: int64

-----------------------------------------------
Para la columna : MonthlyRate
valores unicos :
MonthlyRate
9150     4
11737    3
17001    3
6069     3
21981    3
        ..
25470    1
10205    1
9973     1
17089    1
16642    1
Name: count, Length: 1427, dtype: int64

-----------------------------------------------

### EnvironmentSatisfaction

Por definicion tiene que ser del 1-4.
Hay valores fuera del rango. Hacemos un estudio de los mismos:
- estan comprendidos entre 12-43. 
- con respecto al resto de frecuencuias, estos valores presentan frecuencias muy bajos del 1-7 comparado con los 200-400 de los otros.

Solución:
- valorar poner estos valores como nulos
- extrapolar los valores en funcion de si estan comprendidos entre 10-20 (1),20-30 (2), 30-40(3), 40-50(4). calculamos las medias y observamos si hay variaciones significativas.

In [8]:
"""Transformamos los datos comprendidos entre 10-50 en NULOS"""
#Seleccionamos este rango de valores :
df_envst_error=df_columnas_parte_2[df_columnas_parte_2['EnvironmentSatisfaction'].between(10,50,inclusive='both')]
df_envst_error.head(2)

,EnvironmentSatisfaction,Gender,HourlyRate,JobInvolvement,JobLevel,JobRole,JobSatisfaction,MaritalStatus,MonthlyIncome,MonthlyRate
24,42,0,56,3,2,SALEs exeCUtIVe,4,NaN,"6201,0",2823
30,37,1,81,3,3,Sales ExECuTIVe,3,Divorced,"10447,0",26458

In [9]:
df_columnas_parte_2['EnvironmentSatisfaction']

0        1
1        3
2        3
3        1
4        1
        ..
1609     3
1610     3
1611    13
1612     1
1613     4
Name: EnvironmentSatisfaction, Length: 1614, dtype: int64

In [10]:
df_columnas_parte_2_copy1=df_columnas_parte_2.copy()

In [11]:
#usamos el metodo aply para transformar los datos en nulos.

#definimos una funcion:
def change_to_null(valor):
    if 10<=valor<=50:
        return np.nan #devolvemos un np.nan(valor Not a Number)
    else:
        return valor

In [12]:
df_columnas_parte_2_copy1['EnvironmentSatisfaction']=df_columnas_parte_2_copy1['EnvironmentSatisfaction'].apply(change_to_null)

In [13]:
#comprobamos que han desparecido los valores mas dispares:
df_columnas_parte_2_copy1['EnvironmentSatisfaction'].value_counts()

EnvironmentSatisfaction
4.0    460
3.0    459
1.0    298
2.0    297
Name: count, dtype: int64

In [14]:
#comprobamos cuantos valores tenemos nulos:
df_columnas_parte_2_copy1['EnvironmentSatisfaction'].isnull().sum()

100

In [16]:
df_columnas_parte_2_copy1.head(2)

,EnvironmentSatisfaction,Gender,HourlyRate,JobInvolvement,JobLevel,JobRole,JobSatisfaction,MaritalStatus,MonthlyIncome,MonthlyRate
0,1.0,0,51,3,5,resEArch DIREcToR,3,NaN,"19537,0",6462
1,3.0,0,65,2,5,ManAGeR,3,NaN,"19999,0",5678

In [ ]:
# es valor int. Sin embargo, me da decimales.

In [62]:
"""Transformamos los datos comprendidos entre 10-50 en valores comprendidos en el rango seleccionado"""
df_columnas_parte_2_copy2=df_columnas_parte_2.copy()

In [60]:
#usamos el metodo aply para transformar los datos en nulos.

#definimos una funcion:
def extrapolate(valor):
    if 4>=valor:
        return valor
    elif 4<valor<=10:
        return 2
    elif 10<valor<20:
        return 2
    elif 20<valor<30:
        return 3
    elif 30<valor<40:
        return
    elif valor>40:
        return 4

In [63]:
df_columnas_parte_2_copy2['EnvironmentSatisfaction']=df_columnas_parte_2_copy2['EnvironmentSatisfaction'].apply(extrapolate)

In [64]:
#comprobamos que se han aplicado los cambios en la columna:
df_columnas_parte_2_copy2['EnvironmentSatisfaction'].value_counts()

EnvironmentSatisfaction
4.0    486
3.0    478
2.0    331
1.0    298
Name: count, dtype: int64

In [66]:
#sacmos los valores estadisticos para ver la influencia de los diferentes metodos
df_columnas_parte_2_copy2['EnvironmentSatisfaction'].describe()

count    1593.000000
mean        2.723164
std         1.088691
min         1.000000
25%         2.000000
50%         3.000000
75%         4.000000
max         4.000000
Name: EnvironmentSatisfaction, dtype: float64

In [67]:
df_columnas_parte_2_copy1['EnvironmentSatisfaction'].describe()

count    1514.000000
mean        2.714003
std         1.098326
min         1.000000
25%         2.000000
50%         3.000000
75%         4.000000
max         4.000000
Name: EnvironmentSatisfaction, dtype: float64

In [68]:
df_columnas_parte_2['EnvironmentSatisfaction'].describe()

count    1614.000000
mean        4.294919
std         6.993559
min         1.000000
25%         2.000000
50%         3.000000
75%         4.000000
max        49.000000
Name: EnvironmentSatisfaction, dtype: float64

In [69]:
df_columnas_parte_2['EnvironmentSatisfaction'].value_counts()

EnvironmentSatisfaction
4     460
3     459
1     298
2     297
12      7
35      6
13      6
14      5
24      5
47      5
36      4
48      4
41      4
46      4
42      4
45      3
11      3
22      3
17      3
18      3
20      3
25      3
27      3
37      2
29      2
19      2
38      2
31      2
15      2
16      2
26      1
39      1
10      1
49      1
21      1
28      1
33      1
43      1
Name: count, dtype: int64

 conclusion:
 Los valores medios no varian significativamente entre un metodo u otro.
 Los valores  unicos tampoco varian significativamente si extrapolamos los datos.

### Age
Transformamos los valores 0 en m (male) y 1 en f(female)

In [71]:
# lo primero que vamos a hacer es crear un diccionario donde:
# las claves sean los valores que tenemos en la columna sobre la que queremos aplicar el map
# los valores del diccionario serán los valores nuevos que queremos tener en la columna
# En nuestro caso queremos reemplazar los 0 por m y los 1 por f
dicc_map = {0: "male", 1: "female"}

In [159]:
df_columnas_parte_2_copy3=df_columnas_parte_2.copy()

In [72]:
df_columnas_parte_2_copy3['Gender'] = df_columnas_parte_2_copy3['Gender'] .map(dicc_map)
df_columnas_parte_2_copy3.sample(4)

,EnvironmentSatisfaction,Gender,HourlyRate,JobInvolvement,JobLevel,JobRole,JobSatisfaction,MaritalStatus,MonthlyIncome,MonthlyRate
888,2,male,31,2,3,hEalTHcare ReprEseNtAtIve,3,Single,"10965,0",12066
574,2,female,35,3,3,SalES EXEcUTIVE,4,Married,"7639,0",24525
1465,3,female,82,3,1,hUMaN reSoURces,2,NaN,NaN,19655
179,4,male,55,2,2,LaboraTOry TEcHniCiAN,4,Married,"5126,0",15998

In [74]:
df_columnas_parte_2_copy3['Gender'].value_counts()

Gender
male      971
female    643
Name: count, dtype: int64

In [166]:
#pasamos los valores a tipo object:
df_columnas_parte_2_copy3['Gender']=df_columnas_parte_2_copy3['Gender'].astype('object')

In [167]:
#comprobamos si se ha hecho el cambio:
df_columnas_parte_2_copy3.dtypes

EnvironmentSatisfaction      int64
Gender                      object
HourlyRate                  object
JobInvolvement               int64
JobLevel                     int64
JobRole                     object
JobSatisfaction              int64
MaritalStatus               object
MonthlyIncome               object
MonthlyRate                float64
dtype: object

### HoulyRate
Observamos que dentro de sus valores unicos hay varios 'not available'
Solucion: aplicar gestion de errores y comparar su influencia con las medias.
cambiar tipo de dato a float

In [168]:
df_columnas_parte_2_copy3['HourlyRate'].value_counts()

HourlyRate
Not Available    84
42               33
66               32
48               30
57               29
                 ..
47               15
53               13
68               13
38               12
34               11
Name: count, Length: 72, dtype: int64

In [169]:
#Para poder operar con la media y transformalos en float, es necesario pasar el 'not available' a valores nulo nan:
def change_to_null1 (string):
    if string == 'Not Available':
        return np.nan
    else:
        return string

In [170]:
df_columnas_parte_2_copy3['HourlyRate']=df_columnas_parte_2_copy3['HourlyRate'].apply(change_to_null1)

In [171]:
#comprobamos si el numero de nulos coincide con el numero de 'not available'
df_columnas_parte_2_copy3['HourlyRate'].isnull().sum()

84

conclusion:
Hay 84/1614 valores nulos. 
Habria que estudiar el por qué estos valores son nulos. si el trabajador se encuentra en plantilla y esta en activo--------> aplicar gestion de errores IterativeImputer o KNNImputer
si el valor es nulo por que debe ser nulo -----------> dejar nulos

In [172]:
#visualizamos los datos nulos con el resto de columanns
nulos=df_columnas_parte_2_copy3['HourlyRate'].isnull()

In [173]:
df_columnas_parte_2_copy3[nulos == True]

,EnvironmentSatisfaction,Gender,HourlyRate,JobInvolvement,JobLevel,JobRole,JobSatisfaction,MaritalStatus,MonthlyIncome,MonthlyRate
42,3,0,NaN,3,4,manager,3,Divorced,NaN,13938.0
63,3,0,NaN,3,2,healthcare representative,4,Divorced,NaN,5335.0
64,4,0,NaN,3,4,manufacturing director,3,Married,"13973,0",4161.0
136,21,0,NaN,3,3,sales executive,4,NaN,NaN,6812.0
138,1,0,NaN,3,4,manager,3,Married,NaN,15596.0
...,...,...,...,...,...,...,...,...,...,...
1480,1,0,NaN,2,4,research director,2,NaN,NaN,4345.0
1566,4,0,NaN,3,3,healthcare representative,3,NaN,NaN,14295.0
1578,2,0,NaN,1,1,research scientist,4,Divorced,NaN,18959.0
1604,2,1,NaN,1,1,laboratory technician,4,divorced,NaN,17725.0
1605,2,0,NaN,2,1,sales representative,3,NaN,"2329,0",11737.0

### Job Role
Debemos cambiar todo a minusculas.

In [174]:
df_columnas_parte_2_copy3['JobRole']=df_columnas_parte_2_copy3['JobRole'].str.lower()

In [175]:
df_columnas_parte_2_copy3['JobRole'].value_counts()

JobRole
 sales executive               369
 research scientist            314
 laboratory technician         278
 manufacturing director        158
 healthcare representative     149
 manager                       111
 sales representative           90
 research director              88
 human resources                57
Name: count, dtype: int64

In [176]:
df_columnas_parte_2_copy3['JobRole'].dtypes

dtype('O')

### MaritalStatus
corregimos errores de ortografia

In [177]:
#quitamos mayusculas:
df_columnas_parte_2_copy3['MaritalStatus']=df_columnas_parte_2_copy3['MaritalStatus'].str.lower()

In [178]:
#usamos el metodo replace:
df_columnas_parte_2_copy3['MaritalStatus']=df_columnas_parte_2_copy3['MaritalStatus'].replace('marreid','married')

In [179]:
df_columnas_parte_2_copy3['MaritalStatus'].unique()

array([nan, 'married', 'divorced', 'single'], dtype=object)

In [180]:
df_columnas_parte_2_copy3.sample()

,EnvironmentSatisfaction,Gender,HourlyRate,JobInvolvement,JobLevel,JobRole,JobSatisfaction,MaritalStatus,MonthlyIncome,MonthlyRate
1345,4,0,37,2,1,sales representative,2,single,"2121,0",9947.0

In [181]:
df_columnas_parte_2_copy3['MaritalStatus'].isnull().sum()

651

conclusion:
Hay 651/1614 nulos. relevancia???

### Monthly income/MonthlyRate
Ambas cplumnas tenemos que cambiarlas al tipo float y cambiar',' por '.'

In [182]:
df_columnas_parte_2_copy3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1614 entries, 0 to 1613
Data columns (total 10 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   EnvironmentSatisfaction  1614 non-null   int64
 1   Gender                   1614 non-null   object
 2   HourlyRate               1530 non-null   object
 3   JobInvolvement           1614 non-null   int64
 4   JobLevel                 1614 non-null   int64
 5   JobRole                  1614 non-null   object
 6   JobSatisfaction          1614 non-null   int64
 7   MaritalStatus            963 non-null    object
 8   MonthlyIncome            771 non-null    object
 9   MonthlyRate              1614 non-null   float64
dtypes: float64(1), int64(4), object(5)
memory usage: 126.2+ KB

In [183]:
#al tratarse de valores tipo object, aplicamos el metodo para modificar strings:
df_columnas_parte_2_copy3['MonthlyIncome']=df_columnas_parte_2_copy3['MonthlyIncome'].str.replace(",", ".")

In [184]:
#Cambiamos el tipo de valor 
df_columnas_parte_2_copy3['MonthlyIncome']=df_columnas_parte_2_copy3['MonthlyIncome'].astype('float64')

In [185]:
#comprobamos
df_columnas_parte_2_copy3['MonthlyIncome']

0       19537.0
1       19999.0
2       19232.0
3       17169.0
4           NaN
         ...
1609    10325.0
1610     4447.0
1611        NaN
1612        NaN
1613    10845.0
Name: MonthlyIncome, Length: 1614, dtype: float64

In [186]:
#cambaimos el tipo de valor 
df_columnas_parte_2_copy3['MonthlyRate']=df_columnas_parte_2_copy3['MonthlyRate'].astype('float64')

In [187]:
#comprobamos:
df_columnas_parte_2_copy3['MonthlyRate']

0        6462.0
1        5678.0
2        4933.0
3       26703.0
4        7739.0
         ...
1609     5518.0
1610    23163.0
1611     2560.0
1612    25952.0
1613    24208.0
Name: MonthlyRate, Length: 1614, dtype: float64

In [188]:
df_columnas_parte_2_copy3.sample(10)

,EnvironmentSatisfaction,Gender,HourlyRate,JobInvolvement,JobLevel,JobRole,JobSatisfaction,MaritalStatus,MonthlyIncome,MonthlyRate
1245,4,0,52,3,3,research director,1,NaN,NaN,15067.0
345,35,1,67,1,1,research scientist,2,NaN,2216.0,3872.0
781,3,0,49,3,1,research scientist,3,single,2144.0,2122.0
435,3,1,78,2,3,manufacturing director,4,married,NaN,14618.0
1124,2,0,98,2,2,sales executive,2,NaN,NaN,25166.0
1201,29,1,92,2,2,research scientist,4,married,4422.0,21203.0
278,3,1,61,3,1,human resources,3,NaN,NaN,8916.0
796,2,0,82,4,2,laboratory technician,3,NaN,4404.0,10228.0
1301,42,0,66,3,3,healthcare representative,3,NaN,9824.0,22908.0
842,3,0,60,2,2,manufacturing director,1,married,NaN,9679.0

### lIMPIAR NOMBRE DE COLUMNAS :

In [ ]:
colum_limpias=[]
for columna in df_columnas_parte_2:
    patron='[A-Z][^A-Z]*'
    columna_limpia=re.findall(patron,columna)
    columna_limpia1='_'.join(columna_limpia)
    columna_min=columna_limpia1.lower()
    colum_limpias.append(columna_min)
colum_limpias

In [ ]:
#Hay datos nulos?

In [ ]:
#INFOPRMACION QUE NOS INTERESA CAMBIAR:

In [ ]:
#celda sharon

In [ ]:
#celda isa

In [ ]:
#celda silvia

In [ ]:
#celda lidia